SM_для_EDT/src/DataProcessors/рарусПанельАдминистрированияТОИР/рарусПанельАдминистрированияТОИР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рарусПанельАдминистрированияТОИР</name>
</mdclass:DataProcessor>

SM_для_EDT/src/InformationRegisters/рарусНастройкиФункционалаТОИР/рарусНастройкиФункционалаТОИР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусНастройкиФункционалаТОИР</name>
  <comment>rarus makole</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ИспользоватьСудовоеСнабжение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьИмущественныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьМониторОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСудовоеСнабжение2Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСУБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКлассическийТОИР</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьФлагАналогаВСнабжении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьШтрихкодирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьОстаткиТМЦ</name>
    <comment>makole РАIT-0023494 04082021</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазмещатьИнфоокнаНаНачальнойСтранице</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/DataProcessors/рарусПанельАдминистрированияТОИР/Forms/ОбщиеНастройки/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаКлиенте
Перем ОсновноеСудно;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
				
	УстановитьДоступность();
	
	ЭтоГлавныйУзел = vftОбщегоНазначения.ЭтоГлавныйУзел();
	
	Элементы.ГруппаИспользуемыеПодсистемыУзла.Видимость = Не ЭтоГлавныйУзел;
	Элементы.ГруппаИспользуемыеПодсистемыЦБ.Видимость = ЭтоГлавныйУзел;
	
	ЗаполнитьТаблицуНастроекУзлов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОсновноеСудно = vftОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоУмолчанию("ОсновноеСудно");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	ОбновитьИнтерфейсПрограммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьСудовоеСнабжениеПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИмущественныйУчетПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМониторОбменаПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекУзловИспользоватьСудовоеСнабжениеПриИзменении(Элемент)
	ПриИзмененииНастройкиВТаблице();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекУзловИспользоватьИмущественныйУчетПриИзменении(Элемент)
	ПриИзмененииНастройкиВТаблице();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекУзловИспользоватьМониторОбменаПриИзменении(Элемент)
	ПриИзмененииНастройкиВТаблице();
КонецПроцедуры

// ++ rarus makole 2021-04-21 [РАIT-0023257]
&НаКлиенте
Процедура УчетКартНавигацииКакУслугиПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры 
// -- rarus makole 2021-04-21 [РАIT-0023257]

// ++ rarus makole 2021-08-06 [РАIT-0023494]
// Контроль остатков ТМЦ 
&НаКлиенте
Процедура КонтролироватьОстаткиТМЦПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры
// -- rarus makole 2021-08-06 [РАIT-0023494]

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЗапись(Команда)
	
	ОповещениеОСозданииЗаписи = Новый ОписаниеОповещения("ПослеСозданияНовойЗаписи", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.рарусНастройкиФункционалаТОИР.ФормаЗаписи", Новый Структура("ВернутьСозданный"), ЭтаФорма,,,, ОповещениеОСозданииЗаписи, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Клиент

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	ИмяКонстанты = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	КонецЕсли;
	
	Если ИмяКонстанты <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, ИмяКонстанты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастройки()
	
	СтруктураНастроек = СтруктураНастроек();
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтотОбъект);
	СохранитьИзмененияНастроек(ОсновноеСудно, СтруктураНастроек);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	ОбновитьИнтерфейс = Истина;
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастройкиВТаблице()
	
	СтруктураНастроек = СтруктураНастроек();
	ТекущаяСтрока = Элементы.ТаблицаНастроекУзлов.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ТекущаяСтрока);
	СохранитьИзмененияНастроек(ТекущаяСтрока.Судно, СтруктураНастроек);
	
	// ++ rarus makole 2021-01-21
	// При редактировании настроек в таблице обновление интерфейса замедляет работу
	//ОбновитьПовторноИспользуемыеЗначения();
	//
	//ОбновитьИнтерфейс = Ложь;
	//ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	// -- rarus makole 2021-01-21
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураНастроек()
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("ИспользоватьСудовоеСнабжение");
	// ++ rarus yukuzi 23.12.2020   //
	СтруктураНастроек.Вставить("ИспользоватьСудовоеСнабжение2Приоритет");
	// -- rarus yukuzi 23.12.2020
	СтруктураНастроек.Вставить("ИспользоватьИмущественныйУчет");
	СтруктураНастроек.Вставить("ИспользоватьМониторОбмена");
	
	// ++ rarus selmik 16.02.2021
	СтруктураНастроек.Вставить("ИспользоватьКлассическийТОИР");
	// -- rarus selmik 16.02.2021
	
	// ++ rarus yukuzi 24.03.2021    
	СтруктураНастроек.Вставить("ИспользоватьФлагАналогаВСнабжении");
	// -- rarus yukuzi 24.03.2021
	
	// ++ rarus yukuzi 15.02.2021    // ФТ.СНБ.02. Задача_Штрихкодирование
	СтруктураНастроек.Вставить("ИспользоватьШтрихкодирование");
	// -- rarus yukuzi 15.02.2021

	// ++ rarus makole 2021-08-10 [РАIT-0023494]
	СтруктураНастроек.Вставить("КонтролироватьОстаткиТМЦ");
	// -- rarus makole 2021-08-10 [РАIT-0023494]
	
	// ++ rarus yukuzi 18.10.2021   // СТ Инфоокна
	СтруктураНастроек.Вставить("РазмещатьИнфоокнаНаНачальнойСтранице");
	// -- rarus yukuzi 18.10.2021
	
	Возврат СтруктураНастроек;
	
КонецФункции

&НаКлиенте
Процедура ПослеСозданияНовойЗаписи(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия.ЕстьЗапись = Истина Тогда
		ЗаполнитьТаблицуНастроекУзлов();
		МассивИскомых = ТаблицаНастроекУзлов.НайтиСтроки(Новый Структура("Судно", РезультатЗакрытия.ДанныеЗаписи.Судно));
		Если МассивИскомых.Количество() Тогда
			Элементы.ТаблицаНастроекУзлов.ТекущаяСтрока = МассивИскомых[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
			
////////////////////////////////////////////////////////////////////////////////
// Вызов сервера

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	ИмяКонстанты = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	УстановитьДоступность(РеквизитПутьКДанным);
	ОбновитьПовторноИспользуемыеЗначения();
	Возврат ИмяКонстанты;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Сервер

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	
	ЧастиИмени = СтрРазделить(РеквизитПутьКДанным, ".");
	Если ЧастиИмени.Количество() <> 2 Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяКонстанты = ЧастиИмени[1];
	КонстантаМенеджер = Константы[ИмяКонстанты];
	КонстантаЗначение = НаборКонстант[ИмяКонстанты];
	
	Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
		КонстантаМенеджер.Установить(КонстантаЗначение);
	КонецЕсли;
		
	Возврат ИмяКонстанты;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступность(РеквизитПутьКДанным = "")
		
	Если РеквизитПутьКДанным = "" Тогда
				
		
	КонецЕсли;
	
	// ++ rarus makole 2021-04-21 [РАIT-0023257]
	// предусмотреть два варианта реализации количественного учета карт навигаций 
	// с типом номенклатуры ТМЦ по категории “Карты и публикации” в береговом и судовом модуле.
	// ++ rarus makole 2021-06-10
	//Элементы.УчетКартНавигацииКакУслуги.Доступность = vftОбщегоНазначения.ЭтоГлавныйУзел() И рарусИмущественныйУчетСервер.ИспользоватьИмущественныйУчет();
	ЭтоЦБИВключенИмущественныйУчет = vftОбщегоНазначения.ЭтоГлавныйУзел() И рарусИмущественныйУчетСервер.ИспользоватьИмущественныйУчет();
	Элементы.УчетКартНавигацииКакУслуги.Доступность = ЭтоЦБИВключенИмущественныйУчет;
	// -- rarus makole 2021-06-10
	// -- rarus makole 2021-04-21 [РАIT-0023257]
	
	// ++ rarus makole 2021-06-10 [РАIT-0023374]
	// Учёт номенклатуры разного качества 
	Элементы.ИспользоватьКачествоТоваров.Доступность = ЭтоЦБИВключенИмущественныйУчет;
	// -- rarus makole 2021-06-10 [РАIT-0023374]
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНастроекУзлов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рарусНастройкиФункционалаТОИРСрезПоследних.Судно КАК Судно,
		|	рарусНастройкиФункционалаТОИРСрезПоследних.ИспользоватьСудовоеСнабжение КАК ИспользоватьСудовоеСнабжение,
		|	рарусНастройкиФункционалаТОИРСрезПоследних.ИспользоватьСудовоеСнабжение2Приоритет КАК ИспользоватьСудовоеСнабжение2Приоритет,
		// ++ rarus yukuzi 15.02.2021    // ФТ.СНБ.02. Задача_Штрихкодирование
		|	рарусНастройкиФункционалаТОИРСрезПоследних.ИспользоватьШтрихкодирование КАК ИспользоватьШтрихкодирование,
		// -- rarus yukuzi 15.02.2021		
		|	рарусНастройкиФункционалаТОИРСрезПоследних.ИспользоватьФлагАналогаВСнабжении КАК ИспользоватьФлагАналогаВСнабжении,
		|	рарусНастройкиФункционалаТОИРСрезПоследних.ИспользоватьИмущественныйУчет КАК ИспользоватьИмущественныйУчет,
		|	рарусНастройкиФункционалаТОИРСрезПоследних.ИспользоватьМониторОбмена КАК ИспользоватьМониторОбмена,
		|	рарусНастройкиФункционалаТОИРСрезПоследних.ИспользоватьСУБ КАК ИспользоватьСУБ,
		// ++ rarus makole 2021-08-10 [РАIT-0023494]
		|	рарусНастройкиФункционалаТОИРСрезПоследних.КонтролироватьОстаткиТМЦ КАК КонтролироватьОстаткиТМЦ,
		// -- rarus makole 2021-08-10 [РАIT-0023494]
		// ++ rarus yukuzi 18.10.2021   // СТ Инфоокна
		|	рарусНастройкиФункционалаТОИРСрезПоследних.РазмещатьИнфоокнаНаНачальнойСтранице КАК РазмещатьИнфоокнаНаНачальнойСтранице,
		// -- rarus yukuzi 18.10.2021
		|	рарусНастройкиФункционалаТОИРСрезПоследних.ИспользоватьКлассическийТОИР КАК ИспользоватьКлассическийТОИР
		|ИЗ
		|	РегистрСведений.рарусНастройкиФункционалаТОИР.СрезПоследних(, ) КАК рарусНастройкиФункционалаТОИРСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Судно
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТаблицаНастроекУзлов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если Не ЭтоГлавныйУзел И ТаблицаНастроекУзлов.Количество() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ТаблицаНастроекУзлов[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьИзмененияНастроек(Судно, Параметры)
	
	НаборНастройки = РегистрыСведений.рарусНастройкиФункционалаТОИР.СоздатьНаборЗаписей();
	НаборНастройки.Отбор.Период.Установить(НачалоДня(ТекущаяДатаСеанса()));
	НаборНастройки.Отбор.Судно.Установить(Судно);
	
	НоваяЗапись = НаборНастройки.Добавить();
	НоваяЗапись.Период = НачалоДня(ТекущаяДатаСеанса());
	НоваяЗапись.Судно = Судно;
	ЗаполнитьЗначенияСвойств(НоваяЗапись, Параметры);
	
	НаборНастройки.Записать(Истина);
	
КонецПроцедуры

// ++ rarus yukuzi 20.02.2021  
&НаКлиенте
Процедура ИспользоватьСудовоеСнабжение2ПриоритетПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекУзловИспользоватьСудовоеСнабжение2ПриоритетПриИзменении(Элемент)
	ПриИзмененииНастройкиВТаблице();
КонецПроцедуры
// -- rarus yukuzi 20.02.2021

// ++ rarus yukuzi 18.10.2021   //СТ Инфоокна
&НаКлиенте
Процедура РазмещатьИнфоокнаНаНачальнойСтраницеПриоритетПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекУзловРазмещатьИнфоокнаНаНачальнойСтраницеПриИзменении(Элемент)
	ПриИзмененииНастройкиВТаблице();
КонецПроцедуры 
// -- rarus yukuzi 18.10.2021

// ++ rarus selmik 16.02.2021
&НаКлиенте
Процедура ИспользоватьКлассическийТОИРПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры // -- rarus selmik 16.02.2021

// ++ rarus selmik 16.02.2021
&НаКлиенте
Процедура ТаблицаНастроекУзловИспользоватьКлассическийТОИРПриИзменении(Элемент)
	ПриИзмененииНастройкиВТаблице();
КонецПроцедуры // -- rarus selmik 16.02.2021

// ++ rarus yukuzi 24.03.2021   
&НаКлиенте
Процедура ИспользоватьФлагАналогаВСнабженииПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекУзловИспользоватьФлагАналогаВСнабженииПриИзменении(Элемент)
	ПриИзмененииНастройкиВТаблице();
КонецПроцедуры
// -- rarus yukuzi 24.03.2021
// ++ rarus yukuzi 15.02.2021    // ФТ.СНБ.02. Задача_Штрихкодирование
&НаКлиенте
Процедура ТаблицаНастроекУзловИспользоватьШтрихкодированиеПриИзменении(Элемент)
	ПриИзмененииНастройкиВТаблице();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьШтрихкодированиеПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры
// -- rarus yukuzi 15.02.2021

// ++ rarus makole 2021-06-10 [РАIT-0023374]
// Учёт номенклатуры разного качества 
&НаКлиенте
Процедура ИспользоватьКачествоТоваровПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры
// -- rarus makole 2021-06-10 [РАIT-0023374]
// ++ rarus makole 2021-08-06 [РАIT-0023494]
&НаКлиенте
Процедура ТаблицаНастроекУзловКонтролироватьОстаткиТМЦПриИзменении(Элемент)
	ПриИзмененииНастройкиВТаблице();
КонецПроцедуры
// -- rarus makole 2021-08-06 [РАIT-0023494]

#КонецОбласти
